abandoned
abandoning
abc
abduct
abducted
abhorrent
abilities
ability
able
aboard
about
above
abramovich
abroad
absolute
absolutely
abuse
abuses
academia
academic
academics
academies
accelerate
accelerated
acceleration
accept
accepted
access
accession
acclaimed
accomplish
accomplished
according
account
accountability
accountable
accountant
accounts
accreditation
accusations
accuse
accused
accuses
accusing
achieve
achieved
achievement
acknowledged
acres
acronym
act
acting
action
actions
actively
activists
activities
activity
actor
actors
actress
acts
actual
actually
adamant
adapt
add
addario
added
addiction
adding
addition
additional
address
addressed
addresses
addressing
adds
adjust
administer
administration
admiral
admission
admit
admits
admitted
admitting
adopt
adopted
adoption
adults
advance
advanced
advances
advice
adviser
advisers
aerial
affairs
affected
afraid
after
aftermath
afternoon
afterward
afterwards
again
agata
age
agence
agencies
agency
agenda
agents
ages
aggression
aggressive
aggressor
ago
agree
agreed
agreement
agreements
ahead
aid
aide
aides
aiding
aim
aims
air
airborne
aircraft
aired
airport
airports
airstrike
airstrikes
akin
al
alabama
alarm
alarmingly
albania
alcohol
aleppo
alert
alex
alexander
aligning
alisa
alive
all
allegation
allegations
allege
alleged
allegedly
alleging
alliance
allied
allies
allocate
allow
allowed
allowing
allows
ally
alongside
already
alter
altering
alternative
although
altogether
amal
amassed
ambassador
ambitions
ambush
ambushed
america
american
americans
amid
ammo
ammunition
amnesty
among
amounts
amplify
an
analysis
analyst
analysts
analyzes
anastasia
anatoly
anchor
and
anderson
andersson
andrei
andrew
andrey
andriy
andy
angles
animal
animals
annalena
annex
annexation
annexed
annexing
announce
announced
announcement
announcements
anonymity
anonymous
another
answer
anthem
anti
anticipated
antisatellite
anton
antonio
antony
anxiously
any
anyone
anything
apart
apartment
appalling
apparent
apparently
appeals
appear
appeared
appears
appliances
applicable
application
applications
applied
apply
applying
apprised
approach
approached
appropriate
approval
approved
approximately
april
arabia
arbitration
architecture
are
area
areas
aren
arestovych
argue
argued
argues
arguing
argument
arises
armed
armedforcesukr
armenians
arming
armor
armored
armoured
arms
army
arrangements
arranging
arrest
arrests
arrived
arriving
arrogance
arsenal
art
article
artifacts
artillery
artist
artists
arts
artworks
arty
as
ascertain
asia
aside
ask
asked
asking
asks
aspect
assad
assault
assaults
assembled
assembly
asserted
assertions
assesses
assessment
assignment
assistance
assisting
associate
associated
assorted
assume
assuming
assumptions
assured
astonished
astronaut
astronauts
at
athletes
athletics
atlantic
atrocities
atrocity
attack
attacked
attackers
attacking
attacks
attempt
attempted
attempting
attempts
attendees
attention
attorney
attract
attribute
attributed
attrition
audience
audio
august
aunt
auschwitz
australia
authentic
authentication
author
authored
authoritarianism
authoritarians
authorities
authority
autism
automatically
autonomy
auxiliary
available
avenue
avoid
avoided
award
aware
away
axios
azeem
azov
babyn
bachega
back
backed
backfiring
background
backing
backs
bad
badly
baerbock
baker
balance
ball
baltic
ban
bananarama
bang
bank
banks
banksy
banned
banning
barking
baron
barrage
barrel
barros
base
based
baselessly
basement
bases
bashar
basically
basis
basket
bastards
bathsheba
battalions
battered
battle
battlefield
battlefront
battles
battling
bbc
be
beak
bear
beat
beaten
beatings
beautiful
because
become
becomes
bedingfield
been
before
began
beginning
begun
behalf
behavior
behavioural
being
beings
belarus
belief
believe
believed
believes
belligerent
bellingcat
belong
belongs
below
ben
benedict
benefit
benjamin
berdyansk
berezhnyi
berlin
beseda
beset
besides
besieged
best
bestsellers
bestselling
beth
better
between
bickering
bid
biden
bids
big
bigger
biggest
bilateral
billboard
billboards
billion
bin
bing
biomedical
births
bites
bits
black
blackened
blackmail
blame
blamed
blanket
blast
blasted
blew
blinken
block
blockade
blocking
blocks
blog
bloodied
bloodier
bloodlust
bloodshed
bloomberg
blow
blown
blurred
boarding
boards
boasted
bodies
body
boichak
boiler
bolster
bolstered
bomb
bombarded
bombarding
bombardment
bombardments
bombed
bombing
bombs
bonding
bonds
bonkers
booby
book
booms
boost
boosting
boots
border
borders
boris
borisjohnson
born
borne
borodyanka
borrell
bortnikov
bosnia
boston
botched
both
bottle
bound
bowser
boxes
boxing
boy
boys
brace
brad
brainwashed
branded
brandy
bravery
breach
breaches
bread
break
breakaway
breakdown
breaking
breaks
breakthrough
breakup
breath
breedlove
brent
brevity
bridge
briefed
briefing
brigade
brigadier
bright
bring
bringing
brink
bristol
britain
british
brittle
broad
broadcast
broader
broadhurst
broke
broken
brokered
brookings
brother
brought
brown
browser
brunt
brutal
brutality
brutalized
brutally
bucha
bucharest
budget
build
building
buildings
buildup
built
bullets
bullshit
buns
buoyed
burma
burning
burns
bury
buryn
bus
business
businesses
businessmen
busy
but
butchers
buy
buzova
buzzword
by
cabinet
cadets
cage
cages
cakewalk
calculated
calif
call
called
calling
callousness
calls
calm
calmly
cambodia
came
camera
cameraman
camp
campaign
campaigns
camps
can
canada
cancel
candidate
canines
canisters
cannon
capabilities
capability
capable
capacity
capital
capitalize
capitol
capsule
capsules
captain
captive
captives
captivity
capture
captured
capturing
car
cardin
care
careful
carefully
cares
caring
caroline
carpets
carried
carriers
carries
carry
carrying
cars
cas
case
cases
cash
cast
casualties
catastrophe
catastrophic
category
caught
cause
caused
causing
caveat
cbs
cctv
cease
celebrated
celebrating
celebrations
celebs
cellar
cementing
center
centers
central
centralized
centre
certain
certainly
chain
chair
chairman
chalk
challenge
challenged
challenges
challenging
chambers
champion
championships
chance
chancellor
change
changed
changes
changing
channel
channels
chant
chanted
chaos
chaotic
chapter
characterize
charge
charged
charges
charity
charlie
charliecbs
charred
chase
chatham
cheats
chechen
chechnya
check
cheers
chemical
cheney
chernigiv
chernihiv
cheryl
chief
child
children
china
chinese
chlorine
choice
choices
choose
chooses
choosing
choppersmajor
chosen
chris
christianity
christians
christopher
chronicled
chuck
chunk
church
cia
cigarette
circuit
circulated
circulating
circumstances
cisa
cited
cities
citing
citizen
citizens
citizenship
city
civic
civil
civilian
civilians
claim
claimed
claiming
claims
clarissa
clarissaward
clarity
clark
clash
classmates
claude
clean
clear
cleared
clearer
clearest
clearheaded
clearly
climactic
climb
clip
clooney
close
closed
closely
closer
clothes
cna
cnacna
cnn
cnnsotu
co
coal
coast
coastal
coasts
coat
cocktails
coerce
coercive
cohen
cohesion
coincidence
col
colbert
cold
collaborate
collaboration
collapse
colleague
colleagues
collected
collection
collective
collectively
college
collude
colonel
column
com
combat
combined
combining
come
comes
comfort
comfortable
coming
command
commanded
commander
commanders
commemorating
comment
commentator
comments
commerce
commercial
commission
commissioned
commit
commitment
commits
committed
committee
committing
common
communication
communications
communities
community
commutation
commuted
companies
companions
company
compared
comparing
comparisons
compatible
compensation
compete
complete
completely
complex
complexes
compliance
complicates
composition
compromise
compromises
computers
coms
concentrated
concept
concepts
concern
concerned
concerning
concerns
concessions
conclude
concluded
concludes
conclusion
conclusions
concrete
condemned
condemning
condition
conditions
condoleezza
condolences
condom
conduct
conducted
conducting
conference
confessions
confidence
confident
confined
confirm
confirmed
confiscation
conflict
conflicting
conflicts
confuse
confusion
congress
connected
connecting
connects
conquer
cons
conscription
conscripts
consecutive
consensus
consequence
consequences
consequential
consider
considerably
considered
considering
consistent
consolidate
conspiracy
conspirators
constant
constantly
constitute
constitution
construction
consulate
consumer
contact
contacts
contain
contains
contemplates
contemplating
contesting
context
contexts
continent
continue
continued
continues
continuing
contracts
contradict
contradicting
contradicts
contrast
contributing
control
controlled
controlling
controls
convened
convention
conversation
convinced
convoys
cool
cooper
cooperate
cooperation
coordination
copy
corporation
correct
correlate
correspondent
correspondents
corridor
corridors
corroborate
corroborated
corruption
cosmetics
cosmonaut
cost
costly
costs
couldn
council
counter
counterpart
counterparts
counting
countries
country
counts
couple
coupon
courageously
course
courses
court
courts
cover
covered
covering
covert
cow
crackdown
crackdowns
craft
crates
create
created
creating
creature
credible
credit
cremation
crematoriums
cried
crime
crimea
crimean
crimes
criminal
criminals
crisis
critical
criticized
critics
croatia
crocker
cross
crossed
crouching
crowded
crowds
crown
crucial
cruel
cruelty
cruise
cruiser
crusades
crushing
crying
crystal
cucumbers
culminate
culmination
culpability
cult
cultural
culturally
culture
cultures
cumulative
curfew
current
currently
curtail
custody
customs
cut
cutting
cyber
cyberattacks
cybersecurity
cynical
czech
daily
dalinichenko
damage
damaged
damaging
damascus
danger
dangerous
dangers
daniel
danilchenko
dannatt
dara
daria
dark
darker
dartmouth
data
database
date
dates
daughter
david
dawn
day
days
dc
de
dead
deadline
deadly
deal
dealing
death
deaths
debate
debating
debris
debt
dec
decade
decades
deceased
december
decide
decides
deciding
decimated
decision
decisions
decisively
declaration
declare
declared
declares
declaring
declined
declining
decrees
deeds
deemed
deep
deepest
deeply
defamatory
defeat
defeated
defecting
defectors
defence
defences
defend
defendants
defenders
defending
defense
defenses
defensive
defer
defiant
defined
defines
definitely
definition
defunct
defuse
defying
degrade
degree
dehumanized
delay
delegation
delegitimizes
deleting
deliberate
deliberately
delivered
delivers
delivery
demand
demanding
demands
democracies
democracy
democrat
democratic
democratically
democrats
demolished
demonstrate
demonstrated
demonstrates
demonstrating
demonstrations
demonstrators
demoralize
demoralized
demurred
denazified
denazify
denber
denial
denied
denies
denisova
denounced
denying
denys
department
departure
dependency
depends
depicts
deplored
deploy
deployed
deploying
deployment
deportations
deported
deporting
depot
depressing
deprive
deputy
described
describes
describing
deserve
design
designed
designer
desires
desperate
despite
despotism
destroy
destroyed
destroying
destruction
detailing
details
detained
detainees
detaining
detention
detentions
deter
deteriorates
determine
determined
deterrence
detonation
detonator
devastated
devastating
devastation
developed
developing
development
developments
dialogue
dianna
dictator
did
didn
die
died
difference
different
difficult
dig
digital
diminished
diminishingly
diplomacy
diplomat
diplomatic
diplomatically
diplomats
direct
directions
directly
director
directorate
dirty
disagrees
disappearance
disappearances
disarmament
disarming
disaster
disastrous
disclosed
disclosing
discontent
discouraging
discovered
discovery
discredit
discredited
discrediting
discrepancies
discuss
discussed
discusses
discussions
disgrace
disgust
disinformation
dismissed
disorganized
dispatches
dispel
displace
displaced
displacement
display
disposal
dispose
disproportionately
disputed
disrespected
disrupt
dissent
dissolve
dissuade
distance
distinctly
distinguish
distracted
district
disturbing
ditch
diverse
divert
divided
division
dj
dmitry
dmytro
dnipro
dnr
do
dock
docked
doctor
doctored
doctors
doctrine
document
documentary
documentation
documented
documenting
documents
does
doesn
doesnt
dog
dogs
doing
dollars
dom
domestic
dominated
don
donald
donbas
donetsk
donned
doom
door
doping
dosage
doubled
doubt
doubts
douma
down
downed
downing
downplay
downtown
dozen
dozens
dr
drafted
drags
drama
dramatic
dramatically
draw
drawn
dreary
dress
drew
drinking
drive
driven
driving
drone
dropped
drops
drove
drueke
drug
drummed
dubbed
dubious
duck
ducked
due
during
dust
dwindling
dying
dymerka
dynamics
each
earlier
early
earn
earned
earphones
earth
ease
east
eastern
eastward
easy
eating
ebbing
echo
echoing
economic
economy
edge
edging
edinburgh
edited
editing
editor
edmonds
education
effective
effectively
effectiveness
efficiency
effort
efforts
egregious
either
elaborate
elation
elderly
elect
elected
elections
electric
electricity
electronics
element
elements
elena
eliminate
eliot
elisabeth
elite
else
elsewhere
email
emailed
emails
embankment
embargo
embarked
embarrassing
embarrassment
embassy
embroiled
emerged
emergency
emmanuel
emphasis
emphasises
empire
employ
employee
employees
en
enablers
encapsulates
encircle
encircling
encourage
encouraged
encouraging
end
endanger
ended
endemic
ending
endless
endorsed
ends
endure
endured
enduring
enemy
energy
enerhodar
engage
engaged
engaging
engineered
english
enlargement
enlisted
enough
ensure
enter
entered
entering
entire
entities
entity
environment
environmental
equally
equipment
equipped
era
erase
erected
erik
escalate
escalates
escalating
escalation
escape
eschews
espionage
essay
essential
essentially
essentials
establish
established
establishing
estate
estimate
estimated
estimates
estimating
estonia
et
etc
ethnic
ethnical
ethnonationalist
eu
euan
europe
european
europeans
evacuate
evacuated
evacuating
evacuation
evacuees
even
evening
event
events
eventual
eventually
everyday
everyone
everywhere
evgeny
evidence
evidently
evil
exactly
exaggerate
examined
examples
exams
exc
except
excessive
exchange
exchanging
exclave
exclude
executed
executing
execution
executions
executive
exercise
exercised
exercises
exhausted
existing
exists
exit
expand
expanding
expands
expansion
expect
expected
expecting
expects
expelled
experience
experienced
experiences
experiencing
expert
expertise
experts
expire
explained
explicit
exploitation
exploiting
explore
explosion
explosions
explosive
exports
exposed
express
expressed
extend
extending
extends
extensively
extent
extra
extract
extradite
extraordinary
extreme
extremely
extremist
eyes
fabian
face
facebook
faced
faces
facilitate
facilities
facility
facing
fact
factors
factory
facts
factually
failed
failing
failure
failures
fair
fairly
faith
fake
fall
fallen
falling
false
falsely
faltering
familiar
families
family
famine
famously
far
farber
faring
farmers
farther
fascism
fascists
fast
fatalities
fate
father
fault
favor
favour
fbi
fear
feared
fearful
feb
february
federal
federation
federov
fedorov
feed
feel
feeling
fellow
felt
female
feminist
fend
ferocious
festival
fiction
field
fields
fierce
fiercer
fiercest
fifth
fight
fighter
fighters
fighting
figure
figures
files
filing
film
filmed
filming
filmmaker
films
filtration
final
finally
financial
financing
find
finding
findings
finer
finger
fingerprints
finland
finlandization
finnish
fire
fired
fireeye
fires
firmly
firms
first
firsthand
fits
five
flag
flagged
flags
flagship
flak
flashpoints
fled
flee
fleeing
fleet
fleming
flight
flights
flippers
flooded
flooding
floyd
flying
focus
focused
focusing
fodder
foiling
foils
folks
follow
followed
following
follows
food
foot
footage
for
force
forced
forceful
forces
forcibly
foreign
foremost
forensic
forensics
foresee
forever
forget
forgive
forgiveness
form
formal
formalized
formally
formed
forms
fortify
fortunes
forward
forwardmost
forwards
fought
found
four
fourth
fox
frame
france
francis
frankly
fraudulent
free
freed
freedom
freelance
freelancer
freeman
freeview
french
frequently
friday
friend
friendly
friends
friendship
from
frontline
fruit
frustrated
frustrates
frustration
fsb
fuck
fuel
fueling
fukuyama
fulfilling
full
fully
fumes
fun
function
functioning
fundamentally
funding
funneling
fur
further
future
fyodorov
gabrielle
gained
galina
gambia
game
games
gang
garnered
garrison
gas
gate
gather
gathered
gathering
gave
gazeta
gazprom
gchq
gdp
gen
gender
gendered
genders
general
general_ben
generals
generate
generating
generation
generations
geneva
genital
genocidal
genocide
genocides
genuine
geographic
george
georgia
gerashchenko
gerashchenkoaccording
gerasimov
german
germany
gesture
gets
getting
giant
girl
girls
given
gives
giving
gladkikh
glimmer
glimpse
global
globally
glory
goal
goals
goating
goes
going
gone
good
goods
gordon
got
gotta
gotten
government
governments
governor
grabbed
graduation
grain
grant
graphic
grapple
grappling
grateful
gratuitousness
grave
graves
great
greater
greatness
greene
greenfield
greenhouse
greenlit
greeted
grenade
grenades
grief
grievance
grind
grip
groh
gross
ground
groundless
group
groups
grow
growing
grown
grozny
gru
gruelling
gruesome
gstephanopoulos
guarantee
guaranteeing
guarantees
guard
guardian
guards
guerilla
guess
guideline
guilty
gun
gunfire
gunned
gunpoint
gunshot
gut
guterres
guts
guy
guys
gymnast
hack
hacked
hackers
hacking
hague
half
hall
halt
hamid
hamilton
hand
handbook
hands
handstand
hanging
hanna
happen
happened
happening
happens
harassing
hard
harden
harder
hardest
hardly
hardware
harm
harmed
harming
harms
harrowing
harvard
has
hashtag
hasn
hate
hatred
hauntingly
have
haven
having
haynes
hayward
he
head
headed
headquartered
headquarters
heads
health
hear
heard
hearing
heartbreak
heartland
heat
heavily
heavy
heavyweight
hei
heightened
heinous
held
helicopters
hell
helmet
helmets
help
helped
helping
helpless
helps
helsinki
her
here
hero
heroes
hesitated
hide
hiding
hierarchy
higgins
high
higher
highest
highlighted
highlighting
highly
hijacked
hill
him
himars
himself
hinge
hinting
hired
his
historic
history
hit
hitler
hitting
hobbit
hodges
hold
holding
holds
hole
holed
holocaust
holodomor
home
homed
homemade
homes
homosexuality
honesty
honor
honored
honors
hood
hope
hoped
hopes
horrendous
horrific
horrifying
horror
horrors
hospital
hospitals
host
hostage
hosted
hostomel
hotel
hotline
hour
hours
house
household
households
houses
how
however
howitzer
howling
hoyer
hubris
huddle
huffpost
huge
hugely
hugging
hugo
hugobachega
human
humanitarian
humanity
humanize
humiliate
humiliating
humiliation
hundreds
hurt
husband
huynh
hyper
hypersonic
hypothesis
ibrahim
icj
idaho
idea
ideas
identified
identify
identifying
identities
identity
idiots
if
igniting
ignored
igor
ihor
ii
ill
illegal
illegally
illia
illness
illnesses
illusion
image
imagery
images
immediate
immediately
immensely
imminent
impact
impacted
impaired
impasse
impatient
imperial
implications
implicit
implies
implored
import
importance
important
importantly
imports
impose
imposed
imposing
impossible
imprisonment
improve
in
inability
incentive
incentives
inch
inching
incident
incidents
incitement
incites
include
included
includes
including
incoming
incompetence
incompetent
incomplete
incontrovertible
incorrect
increase
increased
increasing
increasingly
incredible
incredibly
incurred
incursion
independence
independent
independently
indians
indicated
indication
indicative
indicators
indictment
indictments
indiscriminate
indiscriminately
individual
individuals
industrial
industry
inevitable
infantry
inferred
infighting
inflicting
influence
influential
infographics
inform
informal
information
infrastructure
ing
inhuman
inhumane
initial
initially
initiative
initiatives
injured
injuries
inmates
innocent
inquiry
insane
inside
insider
insiders
insisted
insists
inspected
instability
instagram
installed
instance
instances
instead
institute
institutions
instructed
integral
integrity
intel
intelligence
intended
intends
intensely
intensified
intensive
intent
intention
intentionally
intentions
interacting
interagency
intercepted
interests
interfax
interfered
interim
interior
intermarriage
intermittently
internal
international
internationally
internet
interrogated
interrogating
interrogation
interrupted
intervene
intervened
interview
interviewed
intimidate
intimidation
introduced
invade
invaded
invader
invaders
invading
invasion
investigate
investigated
investigating
investigation
investigations
investigative
investigators
investment
invited
inviting
invoked
involve
involved
involvement
involves
involving
inwardly
ionova
iowa
ira
iraq
ire
irina
ironically
irpin
irreparable
iryna
is
isis
islamic
island
isn
isolated
isolating
isolation
iss
issue
issued
issues
it
items
its
itself
iuliia
ivan
ivanna
ivanovich
izium
izyum
jack
jacket
jake
jaketapper
jamal
james
jammable
jammed
jamming
jan
jar
jason
jeffrey
jen
jens
jeremy
jet
jets
jewelry
jewish
jews
jihadi
jim
jimmy
job
joe
john
johnson
join
joined
joining
joint
jon
jonathan
josep
joseph
journal
journalism
journalist
journalists
joy
joyfully
judd
judge
judged
judo
july
june
junior
junk
jurisdiction
just
justice
justification
justify
justifying
kaliningrad
kate
kateryna
katya
kay
kazakhstan
keeping
keeps
kelly
kennedy
kepe
key
keys
kharkiv
khashoggi
kherson
kick
kicking
kidnapped
kidnapping
kidnappings
kids
kiev
kill
killed
killing
killings
kind
kindly
kinds
king
kingdom
kirby
kiriyenko
kisel
kit
klitschko
klympush
km
knew
knockout
know
knowledge
known
kofman
kolobkov
kornienko
korshunov
kostyuchenko
kotkin
kremenchuk
kremlin
kristyan
kuleba
kuvshynova
ky
kyiv
kyrylenko
label
labeled
laboratory
labour
lack
lacking
ladas
lamented
land
landed
landing
landmarks
landscape
language
laptops
large
largely
larger
largest
lashed
last
lasted
late
later
latest
latvia
launch
launched
launchers
launching
lavrov
law
lawful
lawmaker
lawn
laws
lawyer
lawyers
lay
laying
lead
leader
leaderless
leaders
leadership
leading
leaked
learn
learned
leave
leaves
leaving
lebowski
lecturer
led
lee
left
legal
legally
legitimate
legs
leicester
lemon
lengthy
let
lethal
letter
letters
level
levels
lgbtq
liberate
liberated
liberation
liberators
liberties
lie
lies
lieutenant
life
lifetimes
light
like
likelihood
likely
likened
lilies
limbs
limit
limited
limits
linda
line
lined
lines
lining
link
linked
links
lion
liquefied
liquidate
lisa
list
listen
literal
literally
lithuania
litigate
little
live
lived
lives
livestock
living
liz
ll
lnr
local
locals
located
location
locations
locked
logistical
logistics
london
long
longer
longtime
look
looked
looking
looks
loot
looted
looters
looting
lord
lose
losing
loss
losses
lost
lot
lots
loud
louder
love
loved
low
lssc
lt
lublin
lucky
ludicrous
luggage
lugging
luhansk
lviv
lyall
lying
lynsey
lyric
lyudmyla
macdonald
macedonia
machine
machines
macron
mad
made
madrid
magazine
magdalena
magnitude
main
mainstream
maintain
maintained
maj
major
majority
makes
makeup
making
maksym
malicious
mall
malls
malware
malyar
mammoth
man
manage
managed
management
manager
managing
managinga
manchester
mandated
mandates
maneuver
manhood
manifestation
manipulating
manipulator
manned
manner
manning
manpower
many
map
maraud
march
marchenko
maria
mariia
marin
marine
mariupol
mark
market
marks
mars
marta
marveled
masculine
masculinity
mason
mass
massacre
massacring
massive
massively
match
material
materialize
materials
maternity
matter
matters
matthew
matviichuk
maxar
maxars
maximum
may
mayor
mayors
mazyr
mcconnell
mccormack
mccormack_tara
mchancecnn
mckeigue
md
me
mean
meaning
means
meant
meanwhile
measure
measured
measures
mechanism
meddling
media
medic
medical
medicine
medieval
meet
meeting
meets
megalomania
melitopol
melting
member
members
membership
memorial
memories
memory
men
mend
mendel
menn
mention
mentioned
mercenaries
mercenary
mere
merited
message
messages
met
metal
meted
meters
method
methods
mexico
mezentseva
mezentseva_dep
michael
michel
micro
microgravity
microsoft
mid
midday
middle
mightier
mike
mile
miles
militarily
militarism
military
militias
miller
million
millionaire
millions
mind
minded
mindful
mines
minimal
mining
minister
ministers
ministry
minority
minors
minute
minutes
mir
misappropriated
miscalculate
miscalculates
miscalculation
misinformation
misjudged
misjudgements
misleading
misled
mismanaged
mismanaging
misrepresented
miss
missile
missiles
missing
mission
mistake
mistaken
mistreatment
misunderstanding
mitch
mitigate
mixed
mobile
mock
mockler
mod
model
modern
mohammed
molotov
mom
moment
moments
monaco
monday
money
monitored
monitoring
monologue
montenegro
month
months
moral
morale
more
morning
morocco
mortar
moscow
mose
moskva
most
mother
motherland
mothers
motionless
motivated
motivation
motivations
motives
motor
motorized
mount
mounted
mounting
move
moved
movement
movements
moves
movie
movies
moving
mph
mpr
mr
msnbc
much
mukhtar
multilateral
multinational
multiple
multitude
mural
murder
murdered
murderers
murdering
murders
muriel
museum
music
muslim
muslims
must
mutilation
mutual
my
myanmar
mykhailo
mykolaiv
mykyta
naively
naked
name
named
names
naroulia
narration
narrative
narrow
nasa
nascent
natalya
nathalie
nation
national
nationalism
nationals
nations
nato
natosummit
natural
nature
navigator
navy
nazi
nazis
nbc
near
nearby
nearly
nebulous
necessary
neck
need
needed
needs
negotiate
negotiated
negotiation
negotiations
negotiator
negotiators
neighbor
neighborhood
neighboring
neighbors
neither
neo
neptune
netscape
network
networks
neutrality
never
new
newly
news
newspaper
nick
night
nightly
nightmare
nightmarish
niinisto
nikolenko
nine
nme
no
nobody
nod
noise
nomellini
non
nonaligned
nonalignment
noncombatants
none
nonstop
nonviolent
nord
nordic
normal
normally
norman
north
northeast
northern
northwest
norway
norwegian
not
notably
note
noted
notes
noteworthy
nothing
noticed
noting
novaya
november
novoazovsk
now
npr
ntia
nuclear
nudity
number
numbers
numerous
nuremberg
objective
objectives
obligated
obligations
obscure
observed
observers
observing
obtaining
obvious
occasion
occupation
occupied
occupiers
occupying
occur
occurred
occurrences
odesa
odessa
of
off
offenses
offensive
offensives
offer
offered
offering
office
officer
officers
official
officially
officials
offset
offshoot
oh
oil
oksana
olaf
old
oleg
oleksandr
oleksandra
oleksii
oleksiy
olenivka
olga
oligarch
oligarchs
olivier
olympics
ombudsman
on
one
ones
ongoing
online
only
onuch
opcw
open
opened
opening
operate
operation
operational
operations
operative
operator
opinion
opportunity
oppose
opposed
opposite
opposition
oppressed
opting
option
options
or
orbit
orbited
orbiting
order
ordered
ordering
orders
ordinary
organisation
organization
organizations
organizing
origin
original
originated
orr
orsk
osborn
osce
osipov
ostensibly
other
others
otherwise
our
out
outcome
outcomes
outer
outlast
outlet
outline
outnumbering
outrage
outright
outside
outskirts
outspoken
outweighs
over
overarching
overcome
overcrowded
overestimated
overhead
overlay
overlooks
overtake
overtones
own
owner
owns
pac
pace
pacific
packed
pact
page
paid
pain
painful
paint
painted
painting
pair
paly
pamela
pamelabrowncnn
panel
paper
papers
parade
parallels
paranoia
paratroopers
parked
parking
parliament
parliamentarian
parliamentary
part
partial
partially
participated
participating
particular
particularly
parties
partly
partner
partners
partnerships
parts
party
pasha
pashaleeofficial
passageway
passed
passenger
passing
passwords
past
path
pathological
patients
patriarchal
patrick
patriots
patrols
pattern
paul
pause
pavel
pavement
pavlo
pay
payments
pays
peace
peaceful
peacekeeping
peacetime
peak
pedestrian
peeling
peggy
peninsula
penned
pentagon
people
perceived
perception
perceptions
perebyinis
perfect
perform
performed
performing
period
periphery
permanent
permanently
permission
perpetrated
perpetrating
perpetrator
perpetrators
persistent
person
personal
personally
personnel
perspective
persuade
perverted
peskov
pet
petraeus
pets
phase
phenomenal
philip
phone
phones
photo
photographer
photographs
photos
physical
physically
physician
picking
pickled
picture
pictured
piece
pieces
pierced
pierre
piers
pies
pillar
pineapple
pipeline
pitch
pivotal
place
placed
places
placing
plain
plainly
plan
planes
plank
planned
planning
plans
plant
planting
plants
plastic
platform
platforms
played
players
plaza
plead
pleaded
please
pledged
pledging
plight
plug
plus
pocket
podolyak
point
pointed
pointing
points
poised
poison
poisoned
poisoning
poland
polanskiy
police
policy
political
poll
polls
pollution
polyakov
polyanskiy
ponomarenko
pools
poorest
poorly
pop
populace
popular
populated
population
populations
port
portion
portraying
ports
pose
position
positions
positive
possibility
possible
possibly
post
postage
postal
postcards
posted
posthumously
potapenko
potential
potentially
pounded
poured
power
powerful
pows
practical
practically
practices
praised
praising
precarious
precision
predicted
prediction
preferred
pregnant
preparations
prepared
preparing
presence
present
presented
presently
presents
preserve
preserves
president
presidential
presidents
press
presse
pressure
pressured
pretending
pretty
prevalent
prevent
prevented
preventing
previewed
previous
previously
prices
pride
prigozhin
primarily
primary
prime
prince
principal
principle
prior
priority
prison
prisoner
prisoners
private
pro
probability
probably
probing
problem
problems
proceeded
process
produced
product
production
professional
professor
professors
profile
programmer
progress
progressing
progressive
prohibited
prohibition
project
projectile
prominent
promise
promised
promises
promising
promote
promoting
prompt
prompted
proof
propaganda
propagandist
properties
propose
proposed
pros
prosecution
prosecutions
prosecutor
prospect
protect
protected
protecting
protest
protesters
protesting
protests
prove
proves
provide
provided
providing
provinces
provincial
proving
provisions
provocation
provocations
proxies
proximity
psaki
pseudo
pseudonym
psychological
psychologist
public
publicized
publicly
published
pull
pullback
pulled
pulp
pummeling
pumping
punched
punish
punishable
punishing
punishment
punitive
purely
purity
purported
purpose
pursuing
push
pusha
pusha_t
pushed
pushing
put
putin
putinisawarcriminal
putinswarcrimes
putting
pyeongchang
quacks
qualifies
quality
quarter
quash
queen
question
questioned
questioning
questions
quick
quickly
quietly
quips
quite
quo
quota
quoted
race
rachel
racial
rada
radakin
radical
radina
radio
rail
rainn
raise
raised
raises
raising
rallied
rallies
rally
rallying
rambo
ramsay
ran
rand
random
range
ranged
rangerspider
ranging
rank
ranking
ranks
raoul
rape
raped
rapes
rapid
rapists
rapper
rapport
rare
rarely
ratified
rationale
rations
raw
re
reach
reached
reaches
reaching
reacted
read
reading
readmitted
reads
ready
real
reality
realized
really
rear
reason
reasonably
reasons
rebels
rebuild
rebutting
recalled
recalls
recapture
recaptured
received
recent
recently
recipient
reclaimed
reclaims
recognise
recognised
recognition
recognitions
recognize
recognized
recognizing
recommendation
recommended
record
recorded
recording
records
recovering
recruit
recruited
recruiting
recruitment
red
redefine
redeploying
redeployment
redraw
reduce
reduced
reeker
refer
references
referencing
referendums
referred
referring
refineries
refinery
reflect
reflected
refocus
refocused
refocusing
reform
reforms
refuse
refused
refusing
reg
regain
regaining
regard
regardless
regenerate
regime
region
regional
regions
register
regroup
regrouping
regular
regularly
reifying
reigns
reinforced
reinforcements
reinforcing
reinstated
reinstatement
reinvigorated
reiterate
reiterated
rejecting
related
relating
relations
relationships
relatively
relatives
release
released
releasing
relentless
relevant
reliable
reliant
relied
relief
relies
religious
relocated
reluctant
rely
remain
remained
remaining
remains
remarkable
remarking
remarks
remedy
remember
remembered
reminiscent
remnants
remote
remotely
remove
removed
removing
renamed
renaming
renaud
renegade_inc
renew
renewed
reorganizing
rep
repatriate
repeated
repeatedly
repeating
repel
repelled
replace
replenished
replied
report
reported
reportedly
reporter
reporters
reporting
reports
representative
representatives
represented
repression
republic
republican
republicans
republics
reputable
reputation
reputations
request
requested
required
rescue
rescued
research
researching
resemblance
resembles
reserve
reserves
reset
reshaped
resident
residential
residents
resilience
resist
resistance
resisted
resisting
resolution
resonates
resort
resource
resources
respect
respected
respecting
respectively
respond
responded
responding
response
responses
responsibility
responsible
rest
restless
restraint
restricted
rests
result
resulted
results
resume
resupply
resurgence
retain
retains
retaliation
rethink
retired
retort
retreat
retreated
retreating
retribution
return
returned
returning
reuters
revealed
revealing
revenge
review
revolution
reward
rewards
rhetoric
ribbon
rice
richard
richie
rid
ride
ridge
ridiculous
rifle
right
rights
ring
ripe
ripped
risch
rise
rising
risk
risks
river
road
roadblocks
roads
robbed
robinson
robotic
rocket
rocketry
rockets
rocks
rofer
rogue
rohingya
rohingyas
role
roles
rolled
rolling
roman
romania
rooftop
room
rooting
rosatom
roscosmos
rostov
roughly
round
rounded
rounds
route
routes
rt
rubble
rubles
ruined
ruins
rule
ruled
ruler
rulers
rules
ruling
run
running
runs
rusada
russia
russian
russianinvasion
russians
russianswarcrimes
rustem
ruthless
rwanda
rybalko
sabotaging
saboteurs
sadly
safe
safeguarding
safely
safest
safety
said
salisbury
salman
sam
same
sample
sanctioned
sanctions
sandbags
sanders
sandwiched
sang
sank
sanna
satellite
satellites
saturday
saudi
saudis
sauli
savagery
save
saw
say
saying
says
sberbank
scale
scandal
scandals
scape
scar
scary
scattered
scenario
scene
scenes
schaack
schaak
schedule
scheduled
scheme
scholar
scholars
scholz
school
schoolchildren
schools
sciences
scientific
scientist
scientists
sclerosis
scooped
scope
scores
scott
screaming
screened
script
scuttling
se
sea
seagal
seal
sean
search
searched
second
secondary
secrecy
secret
secretaries
secretary
secretly
section
sector
secure
security
see
seeing
seek
seeking
seen
sees
seesaw
seize
seized
seizing
seizure
selection
self
selfie
sell
selling
sen
senate
send
sending
senior
sense
sent
sentences
sep
separate
separated
separatist
separatists
sept
september
seradata
sergeant
sergei
sergey
sergiy
serhiy
series
serious
served
serves
service
serviceman
servicemen
services
set
setback
sets
settlement
settlements
seven
several
severe
severity
sewage
sewn
sexual
sexualized
sexually
shadi
shadow
sham
shaped
share
shared
shares
sharing
sharply
shaved
shaw
she
sheffield
shell
shelled
shelling
shellings
shells
shelter
sheltering
shelters
sherman
shevchenko
shifted
shifting
shifts
ship
ships
shmyhal
shock
shocked
shocking
shoes
shoigu
shootings
shoppers
shopping
short
shortage
shortages
shortening
shortly
shortwave
shot
should
shouldn
shouted
shovels
show
showcase
showed
showing
shown
shows
shvets
sick
sickened
side
sidelined
sides
siege
sight
sighted
sign
signal
signaling
signals
signed
significance
significant
significantly
signs
sikorsky
silence
silent
similar
simple
simply
simpson
since
sincere
single
sinister
sinking
sipped
sir
sirens
sister
sit
site
sites
sits
sitting
situation
situations
sixth
size
skilled
skills
skin
skirmishing
skripal
sky
slammed
slap
slaughter
slaughtered
slava
slaves
slit
slovakia
slovyansk
slowing
slowly
small
smaller
smarter
smashing
smiling
smoke
smoking
smoldering
smoothly
snake
snapped
snihurivka
snipers
snow
so
sobbing
sochi
social
softening
software
soldier
soldiers
solovyov
solution
solve
some
someone
something
sometimes
son
song
songs
soon
sophisticated
sorely
sorry
sort
sought
sound
sounded
sounds
source
sources
south
southeast
southern
southwestern
sovereign
sovereignty
soviet
sow
space
spaceflight
sparked
sparking
speak
speaker
speakers
speaking
special
specialises
specialist
specialized
specific
specifically
specify
speculation
speech
speed
spell
spending
spent
spider
spies
spits
spogli
spoke
spoken
spokesman
spokesperson
sponsor
sponsored
sporadic
sport
sporting
sports
spotted
sprava
sprawling
spread
spree
spring
spy
squads
squalid
square
squares
squat
st
staff
staffed
staffer
stage
staged
stages
staggering
staging
stairwells
stamp
stand
standards
standing
standpoint
stands
standwithukraine
standwithukriane
stanford
star
starbird
starred
start
started
starving
state
stated
statement
statements
states
station
stationed
stations
statista
statistics
stature
status
staunch
stavnitser
stay
staying
stays
stealing
steam
steel
steelworkers
stem
stemming
steny
step
stepanenko
stephanopoulos
stephen
stepping
steps
steven
sticks
stiff
stigmatized
still
sting
stoicism
stole
stolen
stoltenberg
stood
stop
stopped
stoprussia
store
stored
stores
stories
storing
storm
stormer
story
straight
strain
strategic
strategy
stream
streamed
street
streets
strength
strengthen
strengthened
stress
stressing
stretch
stretched
strict
strictly
strike
strikes
striking
strip
stripped
strong
stronger
strongly
strongman
struck
structure
struggled
struggling
stuart
stubbs
stuck
students
studied
studies
studio
study
stuffed
stupid
stuttering
style
styled
stymied
subject
subjected
subjects
submit
submitted
subordinates
subsequently
subsided
substantial
suburb
suburban
suburbs
subway
succeed
successes
successfully
such
sudan
sudden
suffer
suffered
suffering
suggest
suggested
suggesting
suggestion
suggests
suit
sullivan
summarized
summary
summer
summit
sumy
sun
sunday
sunrise
superior
superiors
superpower
supplement
supplied
supplies
supply
support
supported
supporter
supporting
supports
supposed
suppress
supreme
sure
surging
surnames
surovikin
surpassed
surprised
surprisingly
surrender
surrounded
surrounding
survive
surviving
survivor
survivors
susceptible
suspect
suspected
suspects
suspend
suspended
suspicious
sustainable
sustained
sveta
svitlana
swap
sweden
swedes
swedish
sweeping
swelled
swift
swims
switched
switzerland
sydney
symbol
symbolic
symbols
sympathetic
sympathy
symptoms
syria
syrian
syrians
system
systems
table
taboo
tactic
tactical
tactics
tagged
tagging
tai
taken
takeover
takes
taking
talented
talk
talked
talking
talks
tally
tamp
tampered
tank
tanks
tape
tapper
tara
taras
target
targeted
targeting
targets
task
tasked
tasks
taste
tatiana
taught
taylor
teach
team
tearing
tears
technical
techniques
telecommunications
telegram
telegraph
televised
television
tell
telling
tells
tend
tens
tense
tension
tensions
tents
terekhov
term
terms
ternopil
terra
terrible
terrifying
territorial
territories
territory
terror
terrorism
terrorist
terrorists
test
testimonies
tests
thagard
than
thanked
that
the
theater
theatre
theft
their
thejusticedept
them
themselves
then
theories
theory
there
thermal
these
they
thing
things
think
thinks
thinktank
third
thirst
this
thomas
those
though
thought
thousands
threat
threaten
threatened
threatening
threats
three
threshold
threw
throats
through
throw
throwing
thrown
thugs
thursday
thwart
tiananmen
tied
ties
tiger
till
tim
time
timeline
times
tiny
tip
titan
title
titled
to
today
todd
together
toilets
told
toll
tomatoes
tomilenko
tomorrow
ton
tongues
tony
too
took
tool
tools
top
topple
toppled
topples
tormented
torn
torture
tortured
torturers
tossed
total
totally
toured
tower
town
towns
toxic
toxin
toys
trace
track
tracked
tracks
trade
traffic
tragedy
tragic
train
trainees
training
trains
traitors
trajectory
transferring
transformed
transition
transitioned
translate
translation
transport
transported
transporting
trap
trapped
trapping
trashed
traumatizing
traveled
traveling
treacherously
treason
treasury
treat
treated
treating
treatment
treaty
tremendous
trenches
trial
trials
tribunal
trick
trickled
tried
tries
trigger
triggering
trip
tripwire
triumphant
troop
troops
trophy
trouble
troupe
truck
trucks
true
truly
trump
truss
trust
truth
try
trying
tsintsadze
tuesday
tunnel
turkey
turn
turned
turning
tv
tvzvezda
tweet
tweeted
tweeting
twisted
twisting
twitter
two
type
types
typically
tyson
tétrault
uanimals
ubiquitous
uk
ukr
ukrainain
ukraine
ukraini
ukrainian
ukrainians
ukrposhta
ullyot
ultimate
ultimately
umerov
un
un_hrc
unable
unaccompanied
unanimous
unarmed
unaware
unbearable
unbelievably
uncertainty
unclaimed
unclear
uncommon
uncommonly
uncover
uncovered
under
underage
undercutting
undergoing
underground
underlining
undermine
undermined
undermining
understand
understanding
underway
undeterred
undress
unelected
unexpected
unexpectedly
unexploded
unfair
unfamiliarity
unfortunately
unidentified
uniforms
uniofleicester
union
unique
unit
united
units
unity
universities
university
unjust
unknown
unlawful
unlawfully
unleash
unlikely
unmistakable
unnamed
unofficial
unprecedented
unpredictability
unprovoked
unrealistic
unsealed
unspeakable
unveil
unverified
unwilling
unwittingly
up
upcoming
update
updates
upheaval
upon
ups
uptick
uranus
urban
urey
urged
urgent
urgently
urges
us
use
used
useful
users
usher
usually
utilities
utter
uyghurs
vaccines
valeriy
valery
valid
value
van
vande
vandello
vanquish
vaporize
variety
vast
ve
vehicle
vehicles
velyka
venediktova
venture
ventures
venturing
verge
verified
verkhovna
version
very
vessel
veteran
veterans
veto
vice
vicinity
victim
victimization
victimized
victims
victories
victory
video
videos
view
viewed
viewers
views
vigilant
viktorovich
vile
vileness
village
villagers
villages
vindicated
violated
violating
violation
violations
violence
violent
viral
virgin
virility
virtual
virtually
visegrad
visible
visit
visited
visiting
visits
visually
vital
vitale
vitali
vlad
vladamir
vladimir
vladimirovich
voice
voiced
volley
volodymyr
volunteer
volunteered
volunteers
vote
voted
votes
voting
vox
vs
vulnerable
waal
wada
waging
wagner
wait
waiting
wake
walk
walked
walking
wall
wallace
wallenberg
wallis
walter
want
wanted
wanting
wants
war
warcrime
ward
warfare
wariness
warm
warn
warned
warning
warped
warrant
wars
warship
wartime
wary
washing
washington
washingtonpost
wasn
wasted
watch
watching
water
waters
wave
waving
way
ways
we
weakened
weaker
wean
weapon
weaponize
weaponized
weaponizing
weaponry
weapons
wear
webcam
website
wedges
wednesday
week
weekend
weekly
weeks
weeping
weighed
weighing
weight
welcome
welcomed
welcoming
well
wells
went
were
weren
west
western
wgspm
wh
what
whatever
when
where
which
while
whirlwind
whistleblower
white
whitewashing
whitney
whitson
who
whoever
wholeheartedly
why
wide
widely
widening
wider
widespread
wife
will
william
willing
win
wings
wins
winslow
winter
wipe
wiped
wired
wires
wisconsin
with
withdraw
withdrawal
withdrawing
withdrawn
withdrew
within
without
withstand
withstood
witness
witnesses
witnessing
wits
woes
woman
women
won
wonderful
wood
woods
word
words
work
worked
worker
workers
workforce
working
works
world
worried
worry
worse
worsening
worst
worth
worthless
wouldn
wounded
wounds
wrapped
wrappers
wreck
wreckage
wrenching
wrestle
writing
written
wrong
wrote
wsj
wy
wyo
xinjiang
yale
yar
yard
year
years
yearslong
yermak
yes
yesterday
yet
yevgeny
yield
yohann
york
yorker
you
young
younger
your
yourself
youtube
yugoslavia
zakrzewski
zaporizhzhia
zaporizhzhya
zarivna
zelensky
zelenskyy
zelenskyyua
zero
zmiinyi
zone
zones
zvychayna
актер
ли
паша
